<a href="https://colab.research.google.com/github/swarubm/data-analysis/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
lst = [1,2,3,4,5]

pd.Series(lst)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
arr = np.array([1,2,3,4,5])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
pd.Series(index = ['Eshant', 'Pranjal', 'Jayesh', 'Ashish'], data = [1,2,3,4])

Eshant     1
Pranjal    2
Jayesh     3
Ashish     4
dtype: int64

In [5]:
steps = {'day1' : 4000, 'day2' : 3000, 'day3' : 12000}

pd.Series(steps)

day1     4000
day2     3000
day3    12000
dtype: int64

In [6]:
pd.Series(5).repeat(3)

0    5
0    5
0    5
dtype: int64

In [7]:
pd.Series(5).repeat(3).reset_index(drop = True)

0    5
1    5
2    5
dtype: int64

In [8]:
s = pd.Series([10,20]).repeat([5,2]).reset_index(drop = True)

s

0    10
1    10
2    10
3    10
4    10
5    20
6    20
dtype: int64

In [9]:
s[4]

np.int64(10)

In [10]:
s[6]

np.int64(20)

In [11]:
s[2:-2]

2    10
3    10
4    10
dtype: int64

In [12]:
sr = pd.Series([1,2,3,4,5,6,7])

sr.agg([min,max,sum])

/tmp/ipython-input-3916131715.py:3: FutureWarning: The provided callable <built-in function min> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  sr.agg([min,max,sum])
/tmp/ipython-input-3916131715.py:3: FutureWarning: The provided callable <built-in function max> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  sr.agg([min,max,sum])
/tmp/ipython-input-3916131715.py:3: FutureWarning: The provided callable <built-in function sum> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  sr.agg([min,max,sum])

min     1
max     7
sum    28
dtype: int64

In [13]:
sr = pd.Series([1,-2,3,-4,5,-6,7])

sr.abs()

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [18]:
sr1 = pd.Series([1,-2,3])
sr2 = pd.Series([1,2,3])
sr3 = pd.concat([sr2, sr1])

sr3

0    1
1    2
2    3
0    1
1   -2
2    3
dtype: int64

In [19]:
sr3.reset_index(drop = True)

0    1
1    2
2    3
3    1
4   -2
5    3
dtype: int64

In [20]:
sr1

0    1
1   -2
2    3
dtype: int64

In [21]:
type(sr1[0])

numpy.int64

In [22]:
sr1.astype('float')

0    1.0
1   -2.0
2    3.0
dtype: float64

In [23]:
sr1 = pd.Series([1,2,30,4,5,6,7,8,9,20])
sr1

0     1
1     2
2    30
3     4
4     5
5     6
6     7
7     8
8     9
9    20
dtype: int64

In [24]:
sr1.between(10,50)

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
dtype: bool

In [25]:
ser = pd.Series(["Eshant Das" , "Data Science" , "Geeks for Geeks" , 'Hello World' , 'Machine Learning'])

In [26]:
print(ser.str.upper())
print('-'*30)
print(ser.str.lower())

0          ESHANT DAS
1        DATA SCIENCE
2     GEEKS FOR GEEKS
3         HELLO WORLD
4    MACHINE LEARNING
dtype: object
------------------------------
0          eshant das
1        data science
2     geeks for geeks
3         hello world
4    machine learning
dtype: object

In [27]:
for i in ser:
    print(len(i))

10
12
15
11
16

In [28]:
ser = pd.Series(["  Eshant Das" , "Data Science" , "Geeks for Geeks" , 'Hello World' , 'Machine Learning  '])

for i in ser:
    print(i , len(i))

  Eshant Das 12
Data Science 12
Geeks for Geeks 15
Hello World 11
Machine Learning   18

In [29]:
ser = ser.str.strip()

for i in ser:
    print(i , len(i))

Eshant Das 10
Data Science 12
Geeks for Geeks 15
Hello World 11
Machine Learning 16

In [30]:
ser.str.split()

0          [Eshant, Das]
1        [Data, Science]
2    [Geeks, for, Geeks]
3         [Hello, World]
4    [Machine, Learning]
dtype: object

In [31]:
ser.str.split()[0]

['Eshant', 'Das']

In [32]:
ser.str.split()[1]

['Data', 'Science']

In [33]:
ser = pd.Series(["Eshant Das","Data@Science","Geeks for Geeks",'Hello@World','Machine Learning'])

ser.str.contains('@')

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [34]:
ser.str.replace('@',' ')

0          Eshant Das
1        Data Science
2     Geeks for Geeks
3         Hello World
4    Machine Learning
dtype: object

In [35]:
ser.str.count('a')

0    2
1    2
2    0
3    0
4    2
dtype: int64

In [36]:
ser.str.startswith('D')

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [37]:
ser.str.endswith('s')

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [38]:
ser.str.find('Geeks')

0   -1
1   -1
2    0
3   -1
4   -1
dtype: int64

In [39]:
ser.to_list()

['Eshant Das',
 'Data@Science',
 'Geeks for Geeks',
 'Hello@World',
 'Machine Learning']